apache/nuttx/arch/arm/src/stm32/hardware/stm32f412xx_pinmap_legacy.h
#define GPIO_PE0_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN0)
#define GPIO_PE1_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN1)
#define GPIO_PE2_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_PE3_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_PE4_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_PE5_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_PE6_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_PE7_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN7)
#define GPIO_PE8_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN8)
#define GPIO_PE9_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN9)
#define GPIO_PE10_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN10)
#define GPIO_PE11_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN11)
#define GPIO_PE12_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN12)
#define GPIO_PE13_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN13)
#define GPIO_PE14_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN14)
#define GPIO_PE15_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTE | GPIO_PIN15)

#define GPIO_PF0_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN0)
#define GPIO_PF1_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN1)
#define GPIO_PF2_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN2)
#define GPIO_PF3_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN3)
#define GPIO_PF4_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN4)
#define GPIO_PF5_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN5)
#define GPIO_PF6_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN6)
#define GPIO_PF7_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN7)
#define GPIO_PF8_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN8)
#define GPIO_PF9_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN9)
#define GPIO_PF10_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN10)
#define GPIO_PF11_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN11)
#define GPIO_PF12_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN12)
#define GPIO_PF13_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN13)
#define GPIO_PF14_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN14)
#define GPIO_PF15_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTF | GPIO_PIN15)

#define GPIO_PG0_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN0)
#define GPIO_PG1_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN1)
#define GPIO_PG2_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN2)
#define GPIO_PG3_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN3)
#define GPIO_PG4_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN4)
#define GPIO_PG5_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN5)
#define GPIO_PG6_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN6)
#define GPIO_PG7_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_PG8_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_PG9_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN9)
#define GPIO_PG10_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN10)
#define GPIO_PG11_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN11)
#define GPIO_PG12_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_PG13_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_PG14_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN14)
#define GPIO_PG15_EVENTOUT (GPIO_ALT | GPIO_AF15 | GPIO_PORTG | GPIO_PIN15)

#define GPIO_PH0_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTH | GPIO_PIN0)
#define GPIO_PH1_EVENTOUT  (GPIO_ALT | GPIO_AF15 | GPIO_PORTH | GPIO_PIN1)

/* FMPI2C */

#define GPIO_FMPI2C1_SCL_1  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN6)
#define GPIO_FMPI2C1_SCL_2  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTD | GPIO_PIN12)
#define GPIO_FMPI2C1_SCL_3  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FMPI2C1_SCL_4  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTF | GPIO_PIN14)
#define GPIO_FMPI2C1_SCL_5  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN15)
#define GPIO_FMPI2C1_SCL_6  (GPIO_ALT | GPIO_AF9 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN10)

#define GPIO_FMPI2C1_SDA_1  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTC | GPIO_PIN7)
#define GPIO_FMPI2C1_SDA_2  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTD | GPIO_PIN13)
#define GPIO_FMPI2C1_SDA_3  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FMPI2C1_SDA_4  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTF | GPIO_PIN15)
#define GPIO_FMPI2C1_SDA_5  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN3)
#define GPIO_FMPI2C1_SDA_6  (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_OPENDRAIN | GPIO_PORTB | GPIO_PIN14)

#define GPIO_FMPI2C1_SMBA_1 (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN11)
#define GPIO_FMPI2C1_SMBA_2 (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTF | GPIO_PIN13)
#define GPIO_FMPI2C1_SMBA_3 (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN13)
#define GPIO_FMPI2C1_SMBA_4 (GPIO_ALT | GPIO_AF4 | GPIO_SPEED_50MHz | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN5)

/* Flexible Static Memory Controller (FSMC) */

#define GPIO_FSMC_A0_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN0)
#define GPIO_FSMC_A0_2   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTC | GPIO_PIN3)

#define GPIO_FSMC_A1     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN1)
#define GPIO_FSMC_A2     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN2)
#define GPIO_FSMC_A3     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN3)
#define GPIO_FSMC_A4     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN4)
#define GPIO_FSMC_A5     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN5)
#define GPIO_FSMC_A6     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN12)
#define GPIO_FSMC_A7     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN13)
#define GPIO_FSMC_A8     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN14)
#define GPIO_FSMC_A9     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN15)
#define GPIO_FSMC_A10    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN0)
#define GPIO_FSMC_A11    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN1)
#define GPIO_FSMC_A12    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN2)
#define GPIO_FSMC_A13    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN3)
#define GPIO_FSMC_A14    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN4)
#define GPIO_FSMC_A15    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN5)
#define GPIO_FSMC_A16    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN11)
#define GPIO_FSMC_A17    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN12)
#define GPIO_FSMC_A18    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN13)
#define GPIO_FSMC_A19    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN3)
#define GPIO_FSMC_A20    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN4)
#define GPIO_FSMC_A21    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN5)
#define GPIO_FSMC_A22    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN6)
#define GPIO_FSMC_A23    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN2)
#define GPIO_FSMC_A24    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN13)
#define GPIO_FSMC_A25    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTG | GPIO_PIN14)

#define GPIO_FSMC_CLK    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN3)

#define GPIO_FSMC_D0_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FSMC_D0_2   (GPIO_ALT | GPIO_AF10 | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN14)
#define GPIO_FSMC_D1_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FSMC_D1_2   (GPIO_ALT | GPIO_AF10 | GPIO_SPEED_100MHz | GPIO_PORTC | GPIO_PIN6)
#define GPIO_FSMC_D2_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FSMC_D2_2   (GPIO_ALT | GPIO_AF10 | GPIO_SPEED_100MHz | GPIO_PORTC | GPIO_PIN11)
#define GPIO_FSMC_D3_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FSMC_D3_2   (GPIO_ALT | GPIO_AF10 | GPIO_SPEED_100MHz | GPIO_PORTC | GPIO_PIN12)
#define GPIO_FSMC_D4_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN7)
#define GPIO_FSMC_D4_2   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTA | GPIO_PIN2)
#define GPIO_FSMC_D5_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN8)
#define GPIO_FSMC_D5_2   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTA | GPIO_PIN3)
#define GPIO_FSMC_D6_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN9)
#define GPIO_FSMC_D6_2   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTA | GPIO_PIN4)
#define GPIO_FSMC_D7_1   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN10)
#define GPIO_FSMC_D7_2   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTA | GPIO_PIN5)
#define GPIO_FSMC_D8     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN11)
#define GPIO_FSMC_D9     (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN12)
#define GPIO_FSMC_D10    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN13)
#define GPIO_FSMC_D11    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN14)
#define GPIO_FSMC_D12    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN15)
#define GPIO_FSMC_D13_1  (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN8)
#define GPIO_FSMC_D13_2  (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN12)
#define GPIO_FSMC_D14    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN9)
#define GPIO_FSMC_D15    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN10)

#define GPIO_FSMC_DA0    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN14)
#define GPIO_FSMC_DA1    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN15)
#define GPIO_FSMC_DA2    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN0)
#define GPIO_FSMC_DA3    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN1)
#define GPIO_FSMC_DA4    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN7)
#define GPIO_FSMC_DA5    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN8)
#define GPIO_FSMC_DA6    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN9)
#define GPIO_FSMC_DA7    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN10)
#define GPIO_FSMC_DA8    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN11)
#define GPIO_FSMC_DA9    (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN12)
#define GPIO_FSMC_DA10   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN13)
#define GPIO_FSMC_DA11   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN14)
#define GPIO_FSMC_DA12   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTE | GPIO_PIN15)
#define GPIO_FSMC_DA13_1 (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN12)
#define GPIO_FSMC_DA13_2 (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN8)
#define GPIO_FSMC_DA14   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN9)
#define GPIO_FSMC_DA15   (GPIO_ALT | GPIO_AF12 | GPIO_SPEED_100MHz | GPIO_PORTD | GPIO_PIN10)

