apache/nuttx/arch/arm/src/stm32/hardware/stm32f412xx_pinmap_legacy.h
#define GPIO_TIM8_BKIN_1 (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM8_BKIN_2 (GPIO_ALT | GPIO_AF3 | GPIO_PORTF | GPIO_PIN12)
#define GPIO_TIM8_CH1N_1 (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN5)
#define GPIO_TIM8_CH1N_2 (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM8_CH2N_1 (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN0)
#define GPIO_TIM8_CH2N_2 (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM8_CH3N_1 (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN1)
#define GPIO_TIM8_CH3N_2 (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN15)
#define GPIO_TIM8_ETR_1  (GPIO_ALT | GPIO_AF3 | GPIO_SPEED_50MHz | GPIO_FLOAT | GPIO_PORTA | GPIO_PIN0)
#define GPIO_TIM8_ETR_2  (GPIO_ALT | GPIO_AF3 | GPIO_SPEED_50MHz | GPIO_FLOAT | GPIO_PORTF | GPIO_PIN11)
#define GPIO_TIM8_CH1    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN6)
#define GPIO_TIM8_CH2    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN7)
#define GPIO_TIM8_CH3    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_TIM8_CH4    (GPIO_ALT | GPIO_AF3 | GPIO_PORTC | GPIO_PIN9)

#define GPIO_TIM9_CH1_1  (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN2)
#define GPIO_TIM9_CH1_2  (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_TIM9_CH2_1  (GPIO_ALT | GPIO_AF3 | GPIO_PORTA | GPIO_PIN3)
#define GPIO_TIM9_CH2_2  (GPIO_ALT | GPIO_AF3 | GPIO_PORTE | GPIO_PIN6)

#define GPIO_TIM10_CH1_1 (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN8)
#define GPIO_TIM10_CH1_2 (GPIO_ALT | GPIO_AF3 | GPIO_PORTF | GPIO_PIN6)

#define GPIO_TIM11_CH1_1 (GPIO_ALT | GPIO_AF3 | GPIO_PORTB | GPIO_PIN9)
#define GPIO_TIM11_CH1_2 (GPIO_ALT | GPIO_AF3 | GPIO_PORTF | GPIO_PIN7)

#define GPIO_TIM12_CH1   (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_TIM12_CH2   (GPIO_ALT | GPIO_AF9 | GPIO_PORTB | GPIO_PIN15)

#define GPIO_TIM13_CH1_1 (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN6)
#define GPIO_TIM13_CH1_2 (GPIO_ALT | GPIO_AF9 | GPIO_PORTF | GPIO_PIN8)

#define GPIO_TIM14_CH1_1 (GPIO_ALT | GPIO_AF9 | GPIO_PORTA | GPIO_PIN7)
#define GPIO_TIM14_CH1_2 (GPIO_ALT | GPIO_AF9 | GPIO_PORTF | GPIO_PIN9)

/* Trace */

#define GPIO_TRACECLK  (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN2)
#define GPIO_TRACED0_1 (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN3)
#define GPIO_TRACED0_2 (GPIO_ALT | GPIO_AF0 | GPIO_PORTF | GPIO_PIN6)
#define GPIO_TRACED1_1 (GPIO_ALT | GPIO_AF0 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_TRACED1_2 (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN4)
#define GPIO_TRACED1_3 (GPIO_ALT | GPIO_AF0 | GPIO_PORTF | GPIO_PIN7)

#define GPIO_TRACED2_1 (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN5)
#define GPIO_TRACED2_2 (GPIO_ALT | GPIO_AF0 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_TRACED3_1 (GPIO_ALT | GPIO_AF0 | GPIO_PORTE | GPIO_PIN6)
#define GPIO_TRACED3_2 (GPIO_ALT | GPIO_AF0 | GPIO_PORTG | GPIO_PIN14)

/* UARTs/USARTs */

#define GPIO_USART1_CK    (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN8)
#define GPIO_USART1_CTS   (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN11)
#define GPIO_USART1_RTS   (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART1_RX_1  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN10)
#define GPIO_USART1_RX_2  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN3)
#define GPIO_USART1_RX_3  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN7)
#define GPIO_USART1_TX_1  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN9)
#define GPIO_USART1_TX_2  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN6)
#define GPIO_USART1_TX_3  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN15)

#define GPIO_USART2_CK_1  (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN4)
#define GPIO_USART2_CK_2  (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN7)
#define GPIO_USART2_CTS_1 (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN0)
#define GPIO_USART2_CTS_2 (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN3)
#define GPIO_USART2_RTS_1 (GPIO_ALT | GPIO_AF7 | GPIO_PORTA | GPIO_PIN1)
#define GPIO_USART2_RTS_2 (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN4)
#define GPIO_USART2_RX_1  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN3)
#define GPIO_USART2_RX_2  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN6)
#define GPIO_USART2_TX_1  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN2)
#define GPIO_USART2_TX_2  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN5)

#define GPIO_USART3_CK_1  (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN12)
#define GPIO_USART3_CK_2  (GPIO_ALT | GPIO_AF7 | GPIO_PORTC | GPIO_PIN12)
#define GPIO_USART3_CK_3  (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN10)
#define GPIO_USART3_CTS_1 (GPIO_ALT | GPIO_AF8 | GPIO_PORTB | GPIO_PIN13)
#define GPIO_USART3_CTS_2 (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN11)
#define GPIO_USART3_RTS_1 (GPIO_ALT | GPIO_AF7 | GPIO_PORTB | GPIO_PIN14)
#define GPIO_USART3_RTS_2 (GPIO_ALT | GPIO_AF7 | GPIO_PORTD | GPIO_PIN12)
#define GPIO_USART3_RX_1  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN11)
#define GPIO_USART3_RX_2  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN11)
#define GPIO_USART3_RX_3  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN9)
#define GPIO_USART3_RX_4  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN5)
#define GPIO_USART3_TX_1  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTB | GPIO_PIN10)
#define GPIO_USART3_TX_2  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN10)
#define GPIO_USART3_TX_3  (GPIO_ALT | GPIO_AF7 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTD | GPIO_PIN8)

#define GPIO_USART6_CK_1  (GPIO_ALT | GPIO_AF8 | GPIO_PORTC | GPIO_PIN8)
#define GPIO_USART6_CK_2  (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN7)
#define GPIO_USART6_CTS_1 (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN13)
#define GPIO_USART6_CTS_2 (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN15)
#define GPIO_USART6_RTS_1 (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN12)
#define GPIO_USART6_RTS_2 (GPIO_ALT | GPIO_AF8 | GPIO_PORTG | GPIO_PIN8)
#define GPIO_USART6_RX_1  (GPIO_ALT | GPIO_AF8 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN7)
#define GPIO_USART6_RX_2  (GPIO_ALT | GPIO_AF8 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTG | GPIO_PIN9)
#define GPIO_USART6_RX_3  (GPIO_ALT | GPIO_AF8 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN12)
#define GPIO_USART6_TX_1  (GPIO_ALT | GPIO_AF8 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTC | GPIO_PIN6)
#define GPIO_USART6_TX_2  (GPIO_ALT | GPIO_AF8 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTG | GPIO_PIN14)
#define GPIO_USART6_TX_3  (GPIO_ALT | GPIO_AF8 | GPIO_PULLUP | GPIO_SPEED_100MHz | GPIO_PUSHPULL | GPIO_PORTA | GPIO_PIN11)

